## staging: network
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_flow_log.cloud_based_sensor will be created
  + resource "aws_flow_log" "cloud_based_sensor" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:s3:::cbs-satellite-005133826942/vpc_flow_logs/"
      + log_destination_type     = "s3"
      + log_format               = "${vpc-id} ${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status} ${subnet-id} ${instance-id}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CloudBasedSensor" = "true"
          + "CostCentre"       = "CovidShield"
          + "Terraform"        = "true"
        }
      + tags_all                 = {
          + "CloudBasedSensor" = "true"
          + "CostCentre"       = "CovidShield"
          + "Terraform"        = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-0d895a01b47ccfb04"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>